ConfigFiles/InformationRegisters/ПриоритетыВыполненияОбработчиковОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПриоритетыВыполненияОбработчиковОбновления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокПомещенияВОчередь</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокПомещенияОбработчиковВОчередь</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПовторнойЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОсобогоПорядкаРазработкиОбработчиковОбновления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовторнаяЗаписьОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОтличаетсяОтДефолтного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаписываетсяВФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обработчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбработчикиОбновленияИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбработчикиОбновленияИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/ПроблемыОбработчиковОбновленияИнформационнойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПроблемыОбработчиковОбновленияИнформационнойБазы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонфликтЧтенияЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовторнаяЗаписьОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбработчикПисатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбработчикиОбновленияИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбработчикЧитательИлиПисатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбработчикиОбновленияИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/ПорядокПомещенияОбработчиковВОчередь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокПомещенияОбработчиковВОчередь</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеобходимАнализ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НужноПеределатьОбработчики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СначалаОбработчик1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СначалаОбработчик2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеРавноВКакойПоследовательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетПроблемы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/ОбработчикиОбновленияИнформационнойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбработчикиОбновленияИнформационнойБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыполненияОбработчиковОбновления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Библиотека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЗагружено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеИнформацииОбИзменяемыхИЧитаемыхДанныхЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключенВПодсистемуТекущегоПроектаВыполняетсяПараллельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборкаНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийУстановлено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МонопольныйРежимОправдан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИспользованияМонопольногоРежима</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОсобогоПорядкаРазработкиОбработчиковОбновления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборкаЧислом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураЗаполненияДанныхОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередьОтложеннойОбработкиЗагружено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередьОтложеннойОбработкиУстановлено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавляютсяНовыеСсылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапускатьТолькоВГлавномУзлеЗагружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапускатьТолькоВГлавномУзлеУстановлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапускатьИВПодчиненномУзлеРИБСФильтрамиЗагружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапускатьИВПодчиненномУзлеРИБСФильтрамиУстановлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСлужебный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйУказанВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщиеДанныеЗагружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщиеДанныеУстановлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеОбработчикамиЗагружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеОбработчикамиУстановлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопоточныйУстановлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопоточныйЗагружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЧитаемыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлокироватьИнтерфейс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзменяемыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавляютсяНовыеСсылки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлокироватьИнтерфейс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеБлокируемыеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/InformationRegisters/ПриоритетыВыполненияОбработчиковОбновления/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Проверяет пересечения обработчика по данным с другими обработчиками
//
// Параметры:
//  Обработчик	 - СправочникСсылка.ОбработчикиОбновленияИнформационнойБазы 
// 
// Возвращаемое значение:
//  Структура - 
// * ЕстьПересеченияСЧитателями - Булево
// * ЕстьПересеченияСПисателями - Булево
// * СтатусКонфликтов           - ПеречислениеСсылка.СтатусыКонфликтовОбработчиковОбновленияИнформационнойБазы
//
Функция ПересеченияПоДаннымСДругимиОбработчиками(Обработчик) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Проблемы.ОбработчикПисатель
	|ИЗ
	|	РегистрСведений.ПроблемыОбработчиковОбновленияИнформационнойБазы КАК Проблемы
	|ГДЕ
	|	Проблемы.ОбработчикПисатель = &Обработчик
	|	И Проблемы.КонфликтЧтенияЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Проблемы.ОбработчикПисатель
	|ИЗ
	|	РегистрСведений.ПроблемыОбработчиковОбновленияИнформационнойБазы КАК Проблемы
	|ГДЕ
	|	Проблемы.ОбработчикЧитательИлиПисатель = &Обработчик
	|	И Проблемы.КонфликтЧтенияЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Проблемы.ОбработчикПисатель
	|ИЗ
	|	РегистрСведений.ПроблемыОбработчиковОбновленияИнформационнойБазы КАК Проблемы
	|ГДЕ
	|	(Проблемы.ОбработчикЧитательИлиПисатель = &Обработчик
	|			ИЛИ Проблемы.ОбработчикПисатель = &Обработчик)
	|	И Проблемы.ПовторнаяЗаписьОбъекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СтатусПроблемы ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА Обработчики.ЗаполнениеИнформацииОбИзменяемыхИЧитаемыхДанныхЗавершено
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НетПроблемы)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ)
	|				КОНЕЦ
	|		ИНАЧЕ ВложенныйЗапрос.СтатусПроблемы
	|	КОНЕЦ КАК СтатусКонфликтов
	|ИЗ
	|	Справочник.ОбработчикиОбновленияИнформационнойБазы КАК Обработчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Обработчик КАК Обработчик,
	|			ВЫБОР
	|				КОГДА ПорядокПомещенияОбработчиковВОчередь.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ), ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НужноПеределатьОбработчики))
	|					ТОГДА ПорядокПомещенияОбработчиковВОчередь.Ссылка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НетПроблемы)
	|			КОНЕЦ КАК СтатусПроблемы
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Конфликты.Обработчик1 КАК Обработчик,
	|				МИНИМУМ(Конфликты.ПорядокПомещенияВОчередь.Порядок) КАК СтатусПорядок
	|			ИЗ
	|				РегистрСведений.ПриоритетыВыполненияОбработчиковОбновления КАК Конфликты
	|			ГДЕ
	|				Конфликты.Обработчик1 = &Обработчик
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Конфликты.Обработчик1) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.ПорядокПомещенияОбработчиковВОчередь КАК ПорядокПомещенияОбработчиковВОчередь
	|				ПО ВложенныйЗапрос.СтатусПорядок = ПорядокПомещенияОбработчиковВОчередь.Порядок) КАК ВложенныйЗапрос
	|		ПО Обработчики.Ссылка = ВложенныйЗапрос.Обработчик
	|ГДЕ
	|	Обработчики.Ссылка = &Обработчик";
	
	Запрос.УстановитьПараметр("Обработчик", Обработчик);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЕстьПересеченияСЧитателями", Не РезультатЗапроса[0].Пустой());	
	РезультатФункции.Вставить("ЕстьПересеченияСПисателями", Не РезультатЗапроса[1].Пустой());	
	РезультатФункции.Вставить("ЕстьПовторнаяЗапись", Не РезультатЗапроса[2].Пустой());	
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Выборка.Следующий();
	
	РезультатФункции.Вставить("СтатусКонфликтов",Выборка.СтатусКонфликтов);	
	
	Возврат РезультатФункции;
КонецФункции

Функция ЕстьЦиклВПорядкеОбработчиковОбойтиРекурсивно(Обработчик, СвязанныеОбработчики, НаправлениеОбхода, Путь) Экспорт
	
	Для каждого СвязанныйОбработчик из СвязанныеОбработчики Цикл
		
		Если СвязанныйОбработчик = Обработчик Тогда
			Путь.Добавить(СвязанныйОбработчик);
			Возврат Истина;
		КонецЕсли;
		
		СвязанныеОбработчикиТекущего = СвязанныеОбработчики(СвязанныйОбработчик, НаправлениеОбхода);
		
		Если ЕстьЦиклВПорядкеОбработчиковОбойтиРекурсивно(Обработчик, СвязанныеОбработчикиТекущего, НаправлениеОбхода, Путь) Тогда
			Путь.Добавить(СвязанныйОбработчик);
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция РасчитатьПорядокВыполненияОбработчиковПоДефолту(Запись) Экспорт
	
	ЕстьИзменения = Ложь;
	
	Если Запись.ПорядокПомещенияВОчередь <> Перечисления.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ
		Или Запись.ПорядокОтличаетсяОтДефолтного Тогда
		Возврат ЕстьИзменения;
	КонецЕсли;
	
	Выборка = РезультатЗапросаПоПриоритетам(Запись.Обработчик1, Запись.Обработчик2, "Установка");
	
	Если Выборка.Следующий() Тогда
		ПорядокПоДефолту = Выборка.ПорядокПомещенияВОчередь;
	Иначе
		ПорядокПоДефолту = Перечисления.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ;
	КонецЕсли;
	
	Если ПорядокПоДефолту = Перечисления.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ Тогда 
		Возврат ЕстьИзменения;
	КонецЕсли;
	
	Запись.ПорядокПомещенияВОчередь = ПорядокПоДефолту;
	ЕстьИзменения = Истина;
	
	Возврат ЕстьИзменения;
КонецФункции

Процедура РасчитатьПорядокОтличаетсяОтДефолтного(Запись) Экспорт
	
	Если Запись.ПорядокПомещенияВОчередь = Перечисления.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ
		Или Запись.ПорядокПомещенияВОчередь = Перечисления.ПорядокПомещенияОбработчиковВОчередь.НужноПеределатьОбработчики Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапросаПоПриоритетам(Запись.Обработчик1, Запись.Обработчик2, "Расчет");
	
	Если Выборка.Следующий() Тогда
		ПорядокПоДефолту = Выборка.ПорядокПомещенияВОчередь;
	Иначе
		ПорядокПоДефолту = Перечисления.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ;
	КонецЕсли;
	
	Запись.ПорядокОтличаетсяОтДефолтного = ПорядокПоДефолту <> Запись.ПорядокПомещенияВОчередь;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Обработчик1.Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СвязанныеОбработчики(Обработчик, НаправлениеОбхода)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриоритетыВыполненияОбработчиковОбновления.Обработчик2 КАК СвязанныйОбработчик
	|ИЗ
	|	РегистрСведений.ПриоритетыВыполненияОбработчиковОбновления КАК ПриоритетыВыполненияОбработчиковОбновления
	|ГДЕ
	|	ПриоритетыВыполненияОбработчиковОбновления.ПорядокПомещенияВОчередь = &НаправлениеОбхода
	|	И ПриоритетыВыполненияОбработчиковОбновления.Обработчик1 = &Обработчик";	
	
	Запрос.УстановитьПараметр("Обработчик", Обработчик);
	Запрос.УстановитьПараметр("НаправлениеОбхода", НаправлениеОбхода);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СвязанныйОбработчик");
	
КонецФункции

Функция РезультатЗапросаПоПриоритетам(Обработчик1, Обработчик2, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриоритетыВыполненияОбработчиковОбновления.Обработчик1 КАК Обработчик1,
	|	ПриоритетыВыполненияОбработчиковОбновления.Обработчик2 КАК Обработчик2,
	|	МАКСИМУМ(СначалаОбработчик1.КонфликтЧтенияЗаписи) КАК КонфликтЧтенияЗаписи,
	|	МАКСИМУМ(СначалаОбработчик1.ПовторнаяЗаписьОбъекта) КАК ПовторнаяЗаписьОбъекта,
	|	ВЫБОР
	|		КОГДА ПриоритетыВыполненияОбработчиковОбновления.Обработчик1.МонопольныйРежимОправдан
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НетПроблемы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ СначалаОбработчик1.ОбработчикПисатель ЕСТЬ NULL 
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.СначалаОбработчик1)
	|				КОГДА НЕ СначалаОбработчик2.ОбработчикПисатель ЕСТЬ NULL 
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.СначалаОбработчик2)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ)
	|			КОНЕЦ
	|	КОНЕЦ КАК ПорядокПомещенияВОчередь
	|ИЗ
	|	РегистрСведений.ПриоритетыВыполненияОбработчиковОбновления КАК ПриоритетыВыполненияОбработчиковОбновления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроблемыОбработчиковОбновленияИнформационнойБазы КАК СначалаОбработчик1
	|		ПО ПриоритетыВыполненияОбработчиковОбновления.Обработчик1 = СначалаОбработчик1.ОбработчикПисатель
	|			И ПриоритетыВыполненияОбработчиковОбновления.Обработчик2 = СначалаОбработчик1.ОбработчикЧитательИлиПисатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроблемыОбработчиковОбновленияИнформационнойБазы КАК СначалаОбработчик2
	|		ПО ПриоритетыВыполненияОбработчиковОбновления.Обработчик1 = СначалаОбработчик2.ОбработчикЧитательИлиПисатель
	|			И ПриоритетыВыполненияОбработчиковОбновления.Обработчик2 = СначалаОбработчик2.ОбработчикПисатель
	|ГДЕ
	|	ПриоритетыВыполненияОбработчиковОбновления.Обработчик1 = &Обработчик1
	|	И ПриоритетыВыполненияОбработчиковОбновления.Обработчик2 = &Обработчик2
	|	И (НЕ ПриоритетыВыполненияОбработчиковОбновления.ПорядокОтличаетсяОтДефолтного
	|			ИЛИ &Режим = ""Расчет"")
	|	И (ПриоритетыВыполненияОбработчиковОбновления.ПорядокПомещенияВОчередь = ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ)
	|			ИЛИ &Режим = ""Расчет"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриоритетыВыполненияОбработчиковОбновления.Обработчик1,
	|	ПриоритетыВыполненияОбработчиковОбновления.Обработчик2,
	|	ВЫБОР
	|		КОГДА ПриоритетыВыполненияОбработчиковОбновления.Обработчик1.МонопольныйРежимОправдан
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НетПроблемы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ СначалаОбработчик1.ОбработчикПисатель ЕСТЬ NULL 
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.СначалаОбработчик1)
	|				КОГДА НЕ СначалаОбработчик2.ОбработчикПисатель ЕСТЬ NULL 
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.СначалаОбработчик2)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ)
	|			КОНЕЦ
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(ЕСТЬNULL(СначалаОбработчик1.КонфликтЧтенияЗаписи, ЛОЖЬ)) = ИСТИНА
	|			И МАКСИМУМ(ЕСТЬNULL(СначалаОбработчик1.ПовторнаяЗаписьОбъекта, ЛОЖЬ)) = ЛОЖЬ
	|		ИЛИ МАКСИМУМ(ЕСТЬNULL(СначалаОбработчик2.КонфликтЧтенияЗаписи, ЛОЖЬ)) = ИСТИНА
	|			И МАКСИМУМ(ЕСТЬNULL(СначалаОбработчик2.ПовторнаяЗаписьОбъекта, ЛОЖЬ)) = ЛОЖЬ)";	
	
	Запрос.УстановитьПараметр("Обработчик1", Обработчик1);
	Запрос.УстановитьПараметр("Обработчик2", Обработчик2);
	Запрос.УстановитьПараметр("Режим", Режим);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти
